## Plan Result (demo_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 22 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal-demo&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pip-frontend-b2c-staff&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + expiration_date          = (known after apply)
      + host_name                = "juror-public.demo.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "juror-public"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "jurorpublicdemoPremium"
      + resource_group_name   = "lz-demo-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-nonprodi-palo-sdsdemoappgateway.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "juror-public"
      + origin_host_header             = "juror-public.demo.platform.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                                                        = (known after apply)
      + name                                                      = "juror-public"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "juror-public"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/afdEndpoints/sdshmcts-demo"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "juror-publicHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
      + id                       = (known after apply)
      + name                     = "jurorpublicdemoPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["c100-application"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.c100-application"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["darts-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.darts-portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.juror-public"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pip-frontend"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pip-frontend"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pip-frontend-b2c-sign-in"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.sign-in.demo.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/demo.platform.hmcts.net/TXT/_dnsauth.sign-in" -> (known after apply)
      ~ name                = "_dnsauth.sign-in" -> "_dnsauth.sign-in.pip-frontend" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pip-frontend-b2c-staff"] must be replaced
-/+ resource "azurerm_dns_txt_record" "public_dns_record" {
      ~ fqdn                = "_dnsauth.staff.demo.platform.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/demo.platform.hmcts.net/TXT/_dnsauth.staff" -> (known after apply)
      ~ name                = "_dnsauth.staff" -> "_dnsauth.staff.pip-frontend" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal-demo"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal-demo"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pre-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pre-portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sds-api-mgmt"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sds-api-mgmt"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.toffee"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-admin-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-admin-web"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-test-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-test-web"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-video-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.vh-video-web"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "demo.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 22 to add, 1 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":627,"Program":"tfcmt","SHA1":"","Target":"demo_frontdoor","Vars":{}} -->